В рамках БД music напишите след/запросы:
db.tracks.aggregate([
    {
       $match:{tags:'new'},
    },
    { $sample:{size:2}},
    {$project:{title:1, _id:0}}
])
-------------------------------------------------------------------------
2) Вывести имя юзера с самым минимальным балансом
db.users.aggregate([
    { $sort: { balance: 1 } },
{$project:{fullname:1, _id:0}},
    { $limit: 1 } 
])
---------------------------------------------------------------------------
3) Вывести имена юзеров, у которых есть треки

db.users.aggregate([
    {
        $lookup: {
            from: 'tracks', // название колл., откуда взять данные
            localField: '_id', // локальное поле
            foreignField: 'author_id', // внешнее поле
            as: 'tracks' // куда поместить результат
        }
    },
    {
        $match: { tracks:{$ne: []} }
    },
    {$project:{fullname:1, _id:0}}
    
])
-------------------------------------------------------------------------
4) Используя метод aggregate(), вывести ко-во юзеров с балансом до 1000 EUR
db.users.aggregate([
    { $match: { balance: { $lt: 1000 } } },
    { $count: 'users_with_balance_to_1000' }
])
--------------------------------------------------------------------------
5) С помощью инструмента онлайн-проектирования опишите произвольную схему БД (для любой предметной области)
https://dbdiagram.io/d/6537c406ffbf5169f058b8e7